package com.example.dongdemo;

public class loginPack {

//    char head[4];           //里面放"ZJHR"			4个字节  5a 4a 48 52
//    int  length;           //后面数据的长度（包的长度减去8）			4个字节    94 00 00 00
//    unsigned short 		m_nType;	     //请求类型						2个字节   02 01
//    char				m_nIndex;     	 //请求索引，与请求数据包一致   1个字节  00
//    char				m_No;            //暂时不用 					1个字节 00
//    long				m_lKey;		 	 //一级标识  					4个字节 03 00 00 00
//    short				m_cCodeType;	 //证券类型 					2个字节 00  00
//    char				m_cCode[6];		 //证券代码                     6个字节 00 00 00 00 00 00
//    short     			m_nSize;         //请求证券总数                 2个字节 00 00
//    unsigned short		m_nOption;       //为了4字节对齐而添加的字段    2个字节  00 00
//    char			m_szUser[64];	     //用户名     64个字节  67 75 65 73 74 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00
////00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00
//    char			m_szPWD[64];	//密码            64个字节 31 32 33 34 35 36 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00
////00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00

}
